app/serializers/restaurant_serializer.rb

SELECT AVG("reviews"."value") FROM "reviews" WHERE "reviews"."restaurant_id" = ?  [["restaurant_id", 1]]
---
  def review
    object.reviews&.average(:value)