BackEnd/app/controllers/orders_controller.rb

  def create
    order = Order.new(order_params)
    if order.save
---
INSERT INTO "orders" ("name", "phone_number", "total_value", "restaurant_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "José"], ["phone_number", "19 99999 9999"], ["total_value", 152.0], ["restaurant_id", 1], ["created_at", "2020-05-10 11:43:38.172050"], ["updated_at", "2020-05-10 11:43:38.172050"]]

  def set_order
    @order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]