app/models/order.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_price
    @final_price = 0
    order_products.each do |order_product|
      product = Product.find order_product.product_id